Repository: ostorc/minsk
Catalog: src/Minsk/Resources/Strings.*.resx
Languages: cs

# Diagnostic_UnterminatedString
source: Unterminated string literal.
cs: Neukončený řetězec.

# Diagnostic_UnterminatedMultiLineComment
source: Unterminated multi-line comment.
cs: Neukončený více řádkový komentář.

# Diagnostic_UnexpectedToken
source: Unexpected token <{0}>, expected <{1}>.
cs: Neočekávaný token <{0}>, očekávaný byl <{1}>.

# Diagnostic_InvalidNumber
source: The number {0} isn't valid {1}.
cs: Číslo {0} není platný {1}.

# Diagnostic_BadCharacter
source: Bad character input: '{0}'.
cs: Neočekávaný znak na vstupu: '{0}'.

# Diagnostic_UndefinedUnaryOperator
source: Unary operator '{0}' is not defined for type '{1}'.
cs: Unarní operátor '{0}' není definovaný pro typ '{1}'.

# Diagnostic_UndefinedBinaryOperator
source: Binary operator '{0}' is not defined for types '{1}' and '{2}'.
cs: Binární operátor '{0}' není definovaný pro '{1}' a '{2}'.

# Diagnostic_ParameterAlreadyDeclared
source: A parameter with the name '{0}' already exists.
cs: Parametr s názvem '{0}' již existuje.

# Diagnostic_UndefinedVariable
source: Variable '{0}' doesn't exist.
cs: Proměnná '{0}' nexistuje.

# Diagnostic_NotAVariable
source: '{0}' is not a variable.
cs: '{0}' není proměnná.

# Diagnostic_UndefinedType
source: Type '{0}' doesn't exist.
cs: Typ '{0}' nexistuje.

# Diagnostic_CannotConvert
source: Cannot convert type '{0}' to '{1}'.
cs: Nelze převést typ '{0}' na '{1}'.

# Diagnostic_CannotConvertImplicitly
source: Cannot convert type '{0}' to '{1}'. An explicit conversion exists (are you missing a cast?)
cs: Nelze převést typ '{0}' na '{1}'. Existuje explicitní konverze (neschází vám přetypování?)

# Diagnostic_SymbolAlreadyDeclared
source: '{0}' is already declared.
cs: '{0}' je již definován.

# Diagnostic_CannotAssign
source: Variable '{0}' is read-only and cannot be assigned to.
cs: Proměnná '{0}' je pouze ke čtení a nelze do ní zapisovat.

# Diagnostic_UndefinedFunction
source: Function '{0}' doesn't exist.
cs: Funkce '{0}' nexistuje.

# Diagnostic_NotAFunction
source: '{0}' is not a function.
cs: '{0}' není funkce.

# Diagnostic_WrongArgumentCount
source: Function '{0}' requires {1} arguments but was given {2}.
cs: Funkce '{0}' požaduje {1} argument(ů), ale dostala {2}.

# Diagnostic_ExpressionMustHaveValue
source: Expression must have a value.
cs: Výraz musí mít hodnotu.

# Diagnostic_InvalidBreakOrContinue
source: The keyword '{0}' can only be used inside of loops.
cs: Klíčové slovo '{0}' může být použito jen v cyklech.

# Diagnostic_AllPathsMustReturn
source: Not all code paths return a value.
cs: Ne všechny cesty kódu vracejí hodnotu.

# Diagnostic_InvalidReturnExpression
source: Since the function '{0}' does not return a value the 'return' keyword cannot be followed by an expression.
cs: Jelikož funkce '{0}' nevrací hodnotu, tak klíčové slovo 'return' nemůže být následováno výrazem.

# Diagnostic_InvalidReturnWithValueInGlobalStatements
source: The 'return' keyword cannot be followed by an expression in global statements.
cs: Klíčové slovo 'return' nemůže být následováno výrazem v globálním příkazu

# Diagnostic_MissingReturnExpression
source: An expression of type '{0}' is expected.
cs: Výraz typu '{0}' je očekáván.

# Diagnostic_InvalidExpressionStatement
source: Only assignment and call expressions can be used as a statement.
cs: Jako příkaz lze použít pouze přiřazení a nebo volání funkce.

# Diagnostic_OnlyOneFileCanHaveGlobalStatements
source: At most one file can have global statements.
cs: Nanejvýše jeden soubor může mít globální příkazy.

# Diagnostic_UnreachableCode
source: Unreachable code detected.
cs: Byl detekován nedostupný kód.

# Diagnostic_RequiredMethodNotFound
source: The required method '{0}' cannot be resolved among the given references.
cs: Požadovanou metodu '{0}' nelze najít mezi poskytnutými referencemi..

# Diagnostic_RequiredTypeAmbiguousWithMinsk
source: The required type '{0}' ('{1}') was found in multiple references: {2}.
cs: Požadovaný typ '{0}' ('{1}') byl nalezen ve více referencích: {2}.

# Diagnostic_RequiredTypeAmbiguous
source: The required type '{0}' was found in multiple references: {1}.
cs: Požadovaný typ '{0}' byl nalezen ve více referencích: {1}.

# Diagnostic_RequiredTypeNotFound
source: The required type '{0}' cannot be resolved among the given references.
cs: Požadovaný typ '{0}' nelze najít mezi poskytnutými referencemi.

# Diagnostic_RequiredTypeNotFoundWithMinsk
source: The required type '{0}' ('{1}') cannot be resolved among the given references.
cs: Požadovaný typ '{0}' ('{1}') nelze najít mezi poskytnutými referencemi.

# Diagnostic_InvalidReference
source: The reference is not a valid .NET assembly: '{0}'
cs: Reference není platná .NET assembly: '{0}'

# Diagnostic_CannotMixMainAndGlobalStatements
source: Cannot declare main function when global statements are used.
cs: Nelze definovat main funkci když jsou použity globální příkazy.

# Diagnostic_MainMustHaveCorrectSignature
source: main must not take arguments and not return anything.
cs: main funkce nesmí mít žádné parametry a nesmí nic vracet.
